work-specific/customer-release-testing/sltp/test_3.23-PORT_RESET.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.realtime.dslo.assia.com" xmlns:xsd="http://api.realtime.dslo.assia.com/xsd" xmlns:xsd1="http://model.napi.dslo.assia.com/xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<impl:submitRequest>
			<!--Optional:-->
			<impl:request>
				<!--Zero or more repetitions:-->
				<xsd:additionalParameters>
					<!--Optional:-->
					<xsd1:type>realtime.portreset.operation.type</xsd1:type>
					<!--Optional:-->
					<xsd1:value>RESET</xsd1:value>
				</xsd:additionalParameters>
				<!--Optional:-->
				<xsd:entityID>#line_id#</xsd:entityID>
				<!--Optional:-->
				<xsd:requestType>PORT_RESET</xsd:requestType>
			</impl:request>
			<impl:timeout>200</impl:timeout>
		</impl:submitRequest>
	</soapenv:Body>
</soapenv:Envelope>
